diary/201607/15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">

<head>
  <title>git 常用bash命令</title>
  <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
  <meta name="title" content="git 常用bash命令" />
  <meta name="generator" content="Org-mode" />
  <meta name="generated" content="2016-07-22T21:04+0800" />
  <meta name="author" content="ALIANG" />
  <meta name="description" content="" />
  <meta name="keywords" content="DIARY" />

</head>

<body>

  <div id="preamble">

  </div>

  <div id="content">
    <h1 class="title">git 常用bash命令</h1>

    <p>【aliang diary】-青春无限可能，拎得清，爱生活，爱自己
    </p>
    <p>
      -日期：2016-07-12；作者：阿亮；关键字：笔记、git、bash
    </p>
    <div id="table-of-contents">
      <h2>Table of Contents</h2>
      <div id="text-table-of-contents">
        <ul>
          <li><a href="#sec-1">1 git 常用bash命令</a>
            <ul>
              <li><a href="#sec-1-1">1.1 远程仓库相关命令</a></li>
              <li><a href="#sec-1-2">1.2 分支(branch)操作相关命令</a></li>
              <li><a href="#sec-1-3">1.3 创建空的分支</a></li>
              <li><a href="#sec-1-4">1.4 版本(tag)操作相关命令</a></li>
              <li><a href="#sec-1-5">1.5 子模块(submodule)相关操作命令</a></li>
              <li><a href="#sec-1-6">1.6 忽略一些文件、文件夹不提交</a></li>
              <li><a href="#sec-1-7">1.7 回退</a></li>
              <li><a href="#sec-1-8">1.8 Git一键推送多个远程仓库</a></li>
              <li><a href="#sec-1-9">1.9 缓存认证信息</a></li>
              <li><a href="#sec-1-10">1.10 查看提交日志</a></li>
              <li><a href="#sec-1-11">1.11 有选择的合并 - 这个功能最赞，没有之一</a></li>
              <li><a href="#sec-1-12">1.12 Stash未提交的更改</a></li>
              <li><a href="#sec-1-13">1.13 多次修改后拆分提交 - 暂存文件的部分改动</a></li>
              <li><a href="#sec-1-14">1.14 压缩多个Commit</a></li>
              <li><a href="#sec-1-15">1.15 差异查看</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span> git 常用bash命令</h2>
      <div class="outline-text-2" id="text-1">


      </div>

      <div id="outline-container-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span> 远程仓库相关命令</h3>
        <div class="outline-text-3" id="text-1-1">

          <ul>
            <li id="sec-1-1-1">检出仓库<br/>



              <pre class="src src-bash">$ git clone git://github.com/xx/xx.git
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-1-2">检出仓库<br/>



              <pre class="src src-bash">$ git clone -o github -b 2.0.0 git://github.com/xx/xx.git xx2
              </pre>

              <p>
                直接检出分支 2.0.0，指定远程仓库名称为 github （默认为 origin）、检出到文件夹 xx2 (默认为 xx)
              </p>
            </li>
          </ul>
          <ul>
            <li id="sec-1-1-3">查看远程仓库<br/>



              <pre class="src src-bash">$ git remote -v
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-1-4">添加远程仓库<br/>



              <pre class="src src-bash">$ git remote add [name] [url]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-1-5">删除远程仓库<br/>



              <pre class="src src-bash">$ git remote rm [name]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-1-6">修改远程仓库<br/>



              <pre class="src src-bash">$ git remote set-url --push [name] [newUrl]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-1-7">拉取远程仓库<br/>



              <pre class="src src-bash">$ git pull [remoteName] [localBranchName]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-1-8">推送远程仓库<br/>



              <pre class="src src-bash">$ git push [remoteName] [localBranchName]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-1-9">强制推送更改<br/>



              <pre class="src src-bash">$ git push --force origin master
              </pre>

              <p>
                如果想把本地的某个分支test提交到远程仓库，并作为远程仓库的master分支，或者作为另外一个名叫test的分支，如下：
              </p>


              <pre class="src src-org">$ git push origin test:master // &#25552;&#20132;&#26412;&#22320;test&#20998;&#25903;&#20316;&#20026;&#36828;&#31243;&#30340;master&#20998;&#25903;
                $ git push origin test:test // &#25552;&#20132;&#26412;&#22320;test&#20998;&#25903;&#20316;&#20026;&#36828;&#31243;&#30340;test&#20998;&#25903;
              </pre>

            </li>
          </ul>
        </div>

      </div>

      <div id="outline-container-1-2" class="outline-3">
        <h3 id="sec-1-2"><span class="section-number-3">1.2</span> 分支(branch)操作相关命令</h3>
        <div class="outline-text-3" id="text-1-2">

          <ul>
            <li id="sec-1-2-1">查看本地分支<br/>



              <pre class="src src-bash">$ git branch
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-2-2">查看远程分支<br/>



              <pre class="src src-bash">$ git branch -r
              </pre>

              <p>
                如果还是看不到就先 git fetch origin
              </p>
            </li>
          </ul>
          <ul>
            <li id="sec-1-2-3">先创建本地分支<br/>



              <pre class="src src-bash">$ git branch [name]
              </pre>

              <p>
                注意新分支创建后不会自动切换为当前分支
              </p>
            </li>
          </ul>
          <ul>
            <li id="sec-1-2-4">切换分支<br/>



              <pre class="src src-bash">$ git checkout [name]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-2-5">创建新分支并立即切换到新分支<br/>



              <pre class="src src-bash">$ git checkout -b [name]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-2-6">直接检出远程分支<br/>



              <pre class="src src-org">$ git checkout -b [name] [remoteName] (&#22914;&#65306;git checkout -b myNewBranch origin/dragon)
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-2-7">删除分支<br/>



              <pre class="src src-git">$ git branch -d [name] ---- -d&#36873;&#39033;&#21482;&#33021;&#21024;&#38500;&#24050;&#32463;&#21442;&#19982;&#20102;&#21512;&#24182;&#30340;&#20998;&#25903;&#65292;&#23545;&#20110;&#26410;&#26377;&#21512;&#24182;&#30340;&#20998;&#25903;&#26159;&#26080;&#27861;&#21024;&#38500;&#30340;&#12290;&#22914;&#26524;&#24819;&#24378;&#21046;&#21024;&#38500;&#19968;&#20010;&#20998;&#25903;&#65292;&#21487;&#20197;&#20351;&#29992;-D&#36873;&#39033;
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-2-8">合并分支<br/>



              <pre class="src src-git">$ git merge [name]
              </pre>

              <p>
                将名称为[name]的分支与当前分支合并
              </p>
            </li>
          </ul>
          <ul>
            <li id="sec-1-2-9">合并最后的2个提交<br/>



              <pre class="src src-git">$ git rebase -i HEAD~2
              </pre>

              <p>
                数字2按需修改即可（如果需提交到远端
              </p>


              <pre class="src src-git">$ git push -f origin master
              </pre>

              <p>
                慎用）
              </p>
            </li>
          </ul>
          <ul>
            <li id="sec-1-2-10">创建远程分支(本地分支push到远程)<br/>



              <pre class="src src-git">$ git push origin [name]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-2-11">删除远程分支<br/>



              <pre class="src src-git">$ git push origin :heads/[name] &#25110; $ git push origin :[name]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-2-12">修改本地分支名称<br/>



              <pre class="src src-git">git branch -m &lt;old_branch_name&gt; &lt;new_branch_name&gt;
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-2-13">直接修改远程分支名称(不修改本地的)<br/>



              <pre class="src src-git">git push &lt;remote&gt; &lt;remote&gt;/&lt;old_name&gt;:refs/heads/&lt;new_name&gt; :&lt;old_name&gt;
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-2-14">修改本地及其远程分支的名称<br/>



              <pre class="src src-git">1. git branch -m &lt;old_name&gt; &lt;new_name&gt; 2. git push &lt;remote&gt; --set-upstream new_name 3. git
                push &lt;remote&gt; :old_name 4. git fetch &lt;remote&gt; 5. git remote prune &lt;remote&gt;
              </pre>

            </li>
          </ul>
        </div>

      </div>

      <div id="outline-container-1-3" class="outline-3">
        <h3 id="sec-1-3"><span class="section-number-3">1.3</span> 创建空的分支</h3>
        <div class="outline-text-3" id="text-1-3">

          <p>执行命令之前记得先提交你当前分支的修改，否则会被强制删干净没得后悔
          </p>
          <ul>
            <li id="sec-1-3-1">方法1<br/>



              <pre class="src src-git">$ git checkout --orphan &lt;branch_name&gt; $ git rm -rf *
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-3-2">方法2<br/>



              <pre class="src src-git">$ git symbolic-ref HEAD refs/heads/[name] $ rm .git/index $ git clean -fdx
              </pre>

            </li>
          </ul>
        </div>

      </div>

      <div id="outline-container-1-4" class="outline-3">
        <h3 id="sec-1-4"><span class="section-number-3">1.4</span> 版本(tag)操作相关命令</h3>
        <div class="outline-text-3" id="text-1-4">

          <ul>
            <li id="sec-1-4-1">查看版本<br/>



              <pre class="src src-git">$ git tag
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-4-2">创建版本<br/>



              <pre class="src src-git">$ git tag [name]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-4-3">删除版本<br/>



              <pre class="src src-git">$ git tag -d [name]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-4-4">查看远程版本<br/>



              <pre class="src src-git">$ git tag -r
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-4-5">创建远程版本(本地版本push到远程)<br/>



              <pre class="src src-git">$ git push origin [name]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-4-6">删除远程版本<br/>



              <pre class="src src-git">$ git push origin :refs/tags/[name]
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-4-7">合并远程仓库的tag到本地<br/>



              <pre class="src src-git">$ git pull origin --tags
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-4-8">上传本地tag到远程仓库<br/>



              <pre class="src src-git">$ git push origin --tags
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-4-9">创建带注释的tag<br/>



              <pre class="src src-git">$ git tag -a [name] -m 'yourMessage'
              </pre>

            </li>
          </ul>
        </div>

      </div>

      <div id="outline-container-1-5" class="outline-3">
        <h3 id="sec-1-5"><span class="section-number-3">1.5</span> 子模块(submodule)相关操作命令</h3>
        <div class="outline-text-3" id="text-1-5">

          <ul>
            <li id="sec-1-5-1">添加子模块<br/>



              <pre class="src src-git">$ git submodule add [url] [path]
              </pre>

              <p>
                如：$ git submodule add git://github.com/soberh/ui-libs.git src/main/webapp/ui-libs
              </p>
            </li>
          </ul>
          <ul>
            <li id="sec-1-5-2">初始化子模块<br/>



              <pre class="src src-git">$ git submodule init ----&#21482;&#22312;&#39318;&#27425;&#26816;&#20986;&#20179;&#24211;&#26102;&#36816;&#34892;&#19968;&#27425;&#23601;&#34892;
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-5-3">更新子模块<br/>



              <pre class="src src-git">$ git submodule update ----&#27599;&#27425;&#26356;&#26032;&#25110;&#20999;&#25442;&#20998;&#25903;&#21518;&#37117;&#38656;&#35201;&#36816;&#34892;&#19968;&#19979;
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-5-4">删除子模块（分4步走哦）<br/>



              <pre class="src src-git">1) $ git rm --cached [path] 2) &#32534;&#36753;&#8220;.gitmodules&#8221;&#25991;&#20214;&#65292;&#23558;&#23376;&#27169;&#22359;&#30340;&#30456;&#20851;&#37197;&#32622;&#33410;&#28857;&#21024;&#38500;&#25481;
                3) &#32534;&#36753;&#8220; .git/config&#8221;&#25991;&#20214;&#65292;&#23558;&#23376;&#27169;&#22359;&#30340;&#30456;&#20851;&#37197;&#32622;&#33410;&#28857;&#21024;&#38500;&#25481;
                4) &#25163;&#21160;&#21024;&#38500;&#23376;&#27169;&#22359;&#27531;&#30041;&#30340;&#30446;&#24405;
              </pre>

            </li>
          </ul>
        </div>

      </div>

      <div id="outline-container-1-6" class="outline-3">
        <h3 id="sec-1-6"><span class="section-number-3">1.6</span> 忽略一些文件、文件夹不提交</h3>
        <div class="outline-text-3" id="text-1-6">




          <pre class="src src-git">&#22312;&#20179;&#24211;&#26681;&#30446;&#24405;&#19979;&#21019;&#24314;&#21517;&#31216;&#20026;&#8220;.gitignore&#8221;&#30340;&#25991;&#20214;&#65292;&#20889;&#20837;&#19981;&#38656;&#35201;&#30340;&#25991;&#20214;&#22841;&#21517;&#25110;&#25991;&#20214;&#65292;&#27599;&#20010;&#20803;&#32032;&#21344;&#19968;&#34892;&#21363;&#21487;&#65292;&#22914;
            target bin *.db
          </pre>

        </div>

      </div>

      <div id="outline-container-1-7" class="outline-3">
        <h3 id="sec-1-7"><span class="section-number-3">1.7</span> 回退</h3>
        <div class="outline-text-3" id="text-1-7">

          <ul>
            <li id="sec-1-7-1">删除当前仓库内未受版本管理的文件<br/>



              <pre class="src src-git">$ git clean -f
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-7-2">恢复仓库到上一次的提交状态<br/>



              <pre class="src src-git">$ git reset --hard
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-7-3">回退所有内容到上一个版本<br/>



              <pre class="src src-git">$ git reset HEAD^
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-7-4">回退a.py这个文件的版本到上一个版本<br/>



              <pre class="src src-git">$ git reset HEAD^ a.py
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-7-5">回退到某个版本<br/>



              <pre class="src src-git">$ git reset 057d
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-7-6">将本地的状态回退到和远程的一样<br/>



              <pre class="src src-git">$ git reset &#8211;hard origin/master
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-7-7">向前回退到第3个版本<br/>



              <pre class="src src-git">$ git reset &#8211;soft HEAD~3
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-7-8">修改最后的提交日志<br/>



              <pre class="src src-git">$ git commit --amend
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-7-9">修改最后的提交日期为当前时间<br/>



              <pre class="src src-git">$ git commit --amend --date=<span style="color: #00ff00;">"$(date -R)"</span>
              </pre>

            </li>
          </ul>
        </div>

      </div>

      <div id="outline-container-1-8" class="outline-3">
        <h3 id="sec-1-8"><span class="section-number-3">1.8</span> Git一键推送多个远程仓库</h3>
        <div class="outline-text-3" id="text-1-8">

          <ul>
            <li id="sec-1-8-1">编辑本地仓库的.git/config文件<br/>



              <pre class="src src-git">[remote <span style="color: #00ff00;">"all"</span>] url = git@github.com:dragon/test.git url = git@gitcafe.com:dragon/test.git
              </pre>

              <p>
                这样，使用git push all即可一键Push到多个远程仓库中。
              </p>
            </li>
          </ul>
        </div>

      </div>

      <div id="outline-container-1-9" class="outline-3">
        <h3 id="sec-1-9"><span class="section-number-3">1.9</span> 缓存认证信息</h3>
        <div class="outline-text-3" id="text-1-9">




          <pre class="src src-git">$ git config credential.helper cache
          </pre>

        </div>

      </div>

      <div id="outline-container-1-10" class="outline-3">
        <h3 id="sec-1-10"><span class="section-number-3">1.10</span> 查看提交日志</h3>
        <div class="outline-text-3" id="text-1-10">

          <p>》查看文件中的每一行的作者、最新的变更提交和提交时间
          </p>


          <pre class="src src-git">$ git blame [fileName]
          </pre>

          <ul>
            <li id="sec-1-10-1">Git常用操作命令<br/>
              <ul>
                <li>rongjih
                </li>
              </ul>

            </li>
          </ul>
          <ul>
            <li id="sec-1-10-2">查看仓库历史记录<br/> 有三个应该知道的选项。



              <pre class="src src-git">- oneline -&#21387;&#32553;&#27169;&#24335;&#65292;&#22312;&#27599;&#20010;&#25552;&#20132;&#30340;&#26049;&#36793;&#26174;&#31034;&#32463;&#36807;&#31934;&#31616;&#30340;&#25552;&#20132;&#21704;&#24076;&#30721;&#21644;&#25552;&#20132;&#20449;&#24687;&#65292;&#20197;&#19968;&#34892;&#26174;&#31034;&#12290;
                - graph -&#22270;&#24418;&#27169;&#24335;&#65292;&#20351;&#29992;&#35813;&#36873;&#39033;&#20250;&#22312;&#36755;&#20986;&#30340;&#24038;&#36793;&#32472;&#21046;&#19968;&#24352;&#22522;&#20110;&#25991;&#26412;&#26684;&#24335;&#30340;&#21382;&#21490;&#20449;&#24687;&#34920;&#31034;&#22270;&#12290;&#22914;&#26524;&#20320;&#26597;&#30475;&#30340;&#26159;&#21333;&#20010;&#20998;&#25903;&#30340;&#21382;&#21490;&#35760;&#24405;&#30340;&#35805;&#65292;&#35813;&#36873;&#39033;&#26080;&#25928;&#12290;
                - all -&#26174;&#31034;&#25152;&#26377;&#20998;&#25903;&#30340;&#21382;&#21490;&#35760;&#24405;
              </pre>

            </li>
          </ul>
          <ul>
            <li id="sec-1-10-3">把这些选项组合起来之后如下<br/>



              <pre class="src src-git">$ git log --oneline --graph
              </pre>

              <p>
                &ndash;name-status 既可以看到简介的日志信息，也可以看到改了哪些文件，一举两得：
              </p>
            </li>
          </ul>
        </div>

      </div>

      <div id="outline-container-1-11" class="outline-3">
        <h3 id="sec-1-11"><span class="section-number-3">1.11</span> 有选择的合并 - 这个功能最赞，没有之一</h3>
        <div class="outline-text-3" id="text-1-11">

          <p>cherry-pick 可以从不同的分支中捡出一个单独的commit，并把它和你当前的分支合并。如果你以并行方式在处理两个或以上分支，你可能会发现一个在全部分支中都有的bug。如果你在一个分支中解决了它，你可以使用cherry-pick命令把它commit到其它分支上去，而不会弄乱其他的文件或commit。
          </p>


          <pre class="src src-git">$ git cherry-pick [commitHash]
          </pre>

        </div>

      </div>

      <div id="outline-container-1-12" class="outline-3">
        <h3 id="sec-1-12"><span class="section-number-3">1.12</span> Stash未提交的更改</h3>
        <div class="outline-text-3" id="text-1-12">

          <p>正在修改某个bug或者某个特性，又突然被要求展示工作。而现在所做的工作还不足以提交，这个阶段还无法进行展示（不能回到更改之前）。在这种情况下， git stash可以帮到忙了。stash在本质上会取走所有的变更并存储它们以备将来使用。
          </p>


          <pre class="src src-git">$ git stash
          </pre>

          <p>
            检查stash列表：
          </p>


          <pre class="src src-git">$ git stash list
          </pre>

          <p>
            想解除stash并且恢复未提交的变更，就进行apply stash：
          </p>


          <pre class="src src-git">$ git stash apply
          </pre>

          <p>
            如果只想留有余地进行apply stash，给apply添加特定的标识符：
          </p>


          <pre class="src src-git">$ git stash apply stash@{0}
          </pre>

        </div>

      </div>

      <div id="outline-container-1-13" class="outline-3">
        <h3 id="sec-1-13"><span class="section-number-3">1.13</span> 多次修改后拆分提交 - 暂存文件的部分改动</h3>
        <div class="outline-text-3" id="text-1-13">

          <p>一般情况下，创建一个基于特性的提交是比较好的做法，意思是每次提交都必须代表一个新特性的产生或者是一个bug的修复。如果你修复了两个bug，或是添加了多个新特性但是却没有提交这些变化会怎样呢？在这种情况下，你可以把这些变化放在一次提交中。但更好的方法是把文件暂存(Stage)然后分别提交。
            例如你对一个文件进行了多次修改并且想把他们分别提交。这种情况下，可以在 add 命令中加上 -p 参数
          </p>


          <pre class="src src-git">$ git add -p [fileName]
          </pre>

        </div>

      </div>

      <div id="outline-container-1-14" class="outline-3">
        <h3 id="sec-1-14"><span class="section-number-3">1.14</span> 压缩多个Commit</h3>
        <div class="outline-text-3" id="text-1-14">

          <p>用rebase命令把多个commit压缩成一个
          </p>


          <pre class="src src-org">git rebase -i HEAD~[number_of_commits]
          </pre>

          <p>
            如果你想要压缩最后两个commit，你需要运行下列命令：
          </p>


          <pre class="src src-org">git rebase -i HEAD~2
          </pre>

          <p>
            Docs: 7.6 Git 工具 - 重写历史 、3.6 Git 分支 - 变基
          </p>
        </div>

      </div>

      <div id="outline-container-1-15" class="outline-3">
        <h3 id="sec-1-15"><span class="section-number-3">1.15</span> 差异查看</h3>
        <div class="outline-text-3" id="text-1-15">




          <pre class="src src-org">$ git diff --name-status HEAD~2 HEAD~3 &lt;-- &#33719;&#24471;&#20004;&#20010;&#29256;&#26412;&#38388;&#25152;&#26377;&#21464;&#26356;&#30340;&#25991;&#20214;&#21015;&#34920;
            $ git diff HEAD HEAD~1 &lt;-- &#26597;&#30475;&#26368;&#36817;&#20004;&#20010;&#25552;&#20132;&#20043;&#38388;&#30340;&#24046;&#24322;
            $ git diff HEAD HEAD~2 &lt;-- &#26597;&#30475;&#31532;1&#20010;&#19982;&#31532;3&#20010;&#25552;&#20132;&#20043;&#38388;&#30340;&#24046;&#24322;
            $ ^ - &#20195;&#34920;&#29238;&#25552;&#20132;&#65292;^n &#34920;&#31034;&#31532;n&#20010;&#29238;&#25552;&#20132;&#65292;^&#30456;&#24403;&#20110;^1
            git&#23547;&#26681;&#65306;^&#21644;~&#30340;&#21306;&#21035; - &#20998;&#26512;&#24471;&#24456;&#21040;&#20301;
            $ ~ - &#20195;&#34920;&#36830;&#32493;&#30340;&#25552;&#20132;&#65292;~n&#30456;&#24403;&#20110;&#36830;&#32493;&#30340;&#31532;n&#20010;&#25552;&#20132;
            $ git diff master..test &lt;-- &#27604;&#36739;&#20004;&#20010;&#20998;&#25903;&#20043;&#38388;&#30340;&#24046;&#24322;
            $ git diff master...test &lt;-- &#27604;&#36739;master&#12289;test&#30340;&#20849;&#26377;&#29238;&#20998;&#25903;&#21644;
            test &#20998;&#25903;&#20043;&#38388;&#30340;&#24046;&#24322; $ git diff test &lt;-- &#27604;&#36739;&#24403;&#21069;&#24037;&#20316;&#30446;&#24405;&#19982;
            test &#20998;&#25903;&#30340;&#24046;&#24322; $ git diff HEAD &lt;-- &#27604;&#36739;&#24403;&#21069;&#24037;&#20316;&#30446;&#24405;&#19982;&#19978;&#27425;&#25552;&#20132;&#30340;&#24046;&#24322;
            $ git diff HEAD -- ./lib &lt;-- &#27604;&#36739;&#24403;&#21069;&#24037;&#20316;&#30446;&#24405;&#19979;&#30340;lib&#30446;&#24405;&#19982;&#19978;&#27425;&#25552;&#20132;&#30340;&#24046;&#24322;
            $ git diff --stat &lt;-- &#32479;&#35745;&#19968;&#19979;&#26377;&#21738;&#20123;&#25991;&#20214;&#34987;&#25913;&#21160;&#65292;&#26377;&#22810;&#23569;&#34892;&#34987;&#25913;&#21160;
            $ git diff --cached &lt;-- &#26597;&#30475;&#19979;&#27425;&#25552;&#20132;&#26102;&#35201;&#25552;&#20132;&#30340;&#20869;&#23481;(staged,&#28155;&#21152;&#21040;&#32034;&#24341;&#20013;)
          </pre>

        </div>
      </div>
    </div>
  </div>

  <div id="postamble">
    <p class="date">Date: 2016-07-22T21:04+0800</p>
    <p class="author">Author: ALIANG</p>
    <p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version
      24</p>
    <a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

  </div>
</body>

</html>